# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'mysql'
brew 'node'
brew 'yarn'
brew 'python'
brew 'pure'
brew 'bitwarden-cli'
brew 'neovim'

# Apps
cask 'bitwarden'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'raycast'
cask 'readdle-spark'
cask 'slack'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'
cask 'iterm2'
cask 'spotify'
cask 'google-drive'
cask 'telegram'
cask 'microsoft-office'
cask 'bartender'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Speedtest', id: 1153157709
mas 'Amphetamine', id: 937984704
mas 'Wipr', id: 1320666476
mas 'Magnet', id: 441258766
mas 'GoodNotes 5', id: 1444383602
